{"config": [{"config": {"nb_col": 5, "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_row": 5, "W_constraint": null, "W_regularizer": null, "input_dtype": "float32", "b_constraint": null, "subsample": [2, 2], "name": "convolution2d_1", "batch_input_shape": [null, 66, 200, 3], "border_mode": "valid", "nb_filter": 24, "bias": true}, "class_name": "Convolution2D"}, {"config": {"nb_col": 5, "init": "glorot_uniform", "activation": "relu", "nb_row": 5, "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "subsample": [2, 2], "name": "convolution2d_2", "border_mode": "valid", "nb_filter": 36, "bias": true}, "class_name": "Convolution2D"}, {"config": {"nb_col": 5, "init": "glorot_uniform", "activation": "relu", "nb_row": 5, "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "subsample": [2, 2], "name": "convolution2d_3", "border_mode": "valid", "nb_filter": 48, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_1", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"nb_col": 3, "init": "glorot_uniform", "activation": "relu", "nb_row": 3, "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "name": "convolution2d_4", "border_mode": "valid", "nb_filter": 64, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_2", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"nb_col": 3, "init": "glorot_uniform", "activation": "relu", "nb_row": 3, "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "name": "convolution2d_5", "border_mode": "valid", "nb_filter": 64, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "W_constraint": null, "activation": "relu", "b_constraint": null, "activity_regularizer": null, "trainable": true, "bias": true, "W_regularizer": null, "b_regularizer": null, "output_dim": 1164, "name": "dense_1", "input_dim": 1152}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "W_constraint": null, "activation": "relu", "b_constraint": null, "activity_regularizer": null, "trainable": true, "bias": true, "W_regularizer": null, "b_regularizer": null, "output_dim": 100, "name": "dense_2", "input_dim": 1164}, "class_name": "Dense"}, {"config": {"name": "dropout_4", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "W_constraint": null, "activation": "relu", "b_constraint": null, "activity_regularizer": null, "trainable": true, "bias": true, "W_regularizer": null, "b_regularizer": null, "output_dim": 50, "name": "dense_3", "input_dim": 100}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "W_constraint": null, "activation": "relu", "b_constraint": null, "activity_regularizer": null, "trainable": true, "bias": true, "W_regularizer": null, "b_regularizer": null, "output_dim": 10, "name": "dense_4", "input_dim": 50}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "W_constraint": null, "activation": "linear", "b_constraint": null, "activity_regularizer": null, "trainable": true, "bias": true, "W_regularizer": null, "b_regularizer": null, "output_dim": 1, "name": "dense_5", "input_dim": 10}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}