{"keras_version": "1.2.1", "config": [{"config": {"trainable": true, "init": "glorot_uniform", "border_mode": "valid", "nb_filter": 24, "subsample": [2, 2], "b_constraint": null, "name": "convolution2d_1", "nb_row": 5, "bias": true, "input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3], "activation": "relu", "nb_col": 5, "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "init": "glorot_uniform", "border_mode": "valid", "nb_filter": 36, "subsample": [2, 2], "b_constraint": null, "name": "convolution2d_2", "nb_row": 5, "bias": true, "nb_col": 5, "activation": "relu", "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "init": "glorot_uniform", "border_mode": "valid", "nb_filter": 48, "subsample": [2, 2], "b_constraint": null, "name": "convolution2d_3", "nb_row": 5, "bias": true, "nb_col": 5, "activation": "relu", "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "init": "glorot_uniform", "border_mode": "valid", "nb_filter": 64, "subsample": [1, 1], "b_constraint": null, "name": "convolution2d_4", "nb_row": 3, "bias": true, "nb_col": 3, "activation": "relu", "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "init": "glorot_uniform", "border_mode": "valid", "nb_filter": 64, "subsample": [1, 1], "b_constraint": null, "name": "convolution2d_5", "nb_row": 3, "bias": true, "nb_col": 3, "activation": "relu", "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "bias": true, "init": "glorot_uniform", "output_dim": 1164, "activation": "relu", "b_regularizer": null, "b_constraint": null, "name": "dense_1", "input_dim": 1152, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias": true, "init": "glorot_uniform", "output_dim": 100, "activation": "relu", "b_regularizer": null, "b_constraint": null, "name": "dense_2", "input_dim": 1164, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias": true, "init": "glorot_uniform", "output_dim": 50, "activation": "relu", "b_regularizer": null, "b_constraint": null, "name": "dense_3", "input_dim": 100, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "bias": true, "init": "glorot_uniform", "output_dim": 10, "activation": "relu", "b_regularizer": null, "b_constraint": null, "name": "dense_4", "input_dim": 50, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "bias": true, "init": "glorot_uniform", "output_dim": 1, "activation": "linear", "b_regularizer": null, "b_constraint": null, "name": "dense_5", "input_dim": 10, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}