{"config": [{"config": {"batch_input_shape": [null, 66, 200, 3], "b_constraint": null, "nb_row": 5, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "activation": "relu", "trainable": true, "nb_filter": 24, "input_dtype": "float32", "nb_col": 5, "activity_regularizer": null, "name": "convolution2d_1", "init": "glorot_uniform", "subsample": [2, 2], "bias": true, "W_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "nb_row": 5, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "activation": "relu", "nb_filter": 36, "trainable": true, "nb_col": 5, "activity_regularizer": null, "name": "convolution2d_2", "init": "glorot_uniform", "subsample": [2, 2], "bias": true, "W_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "nb_row": 5, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "activation": "relu", "nb_filter": 48, "trainable": true, "nb_col": 5, "activity_regularizer": null, "name": "convolution2d_3", "init": "glorot_uniform", "subsample": [2, 2], "bias": true, "W_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "nb_row": 3, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "activation": "relu", "nb_filter": 64, "trainable": true, "nb_col": 3, "activity_regularizer": null, "name": "convolution2d_4", "init": "glorot_uniform", "subsample": [1, 1], "bias": true, "W_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "nb_row": 3, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "activation": "relu", "nb_filter": 64, "trainable": true, "nb_col": 3, "activity_regularizer": null, "name": "convolution2d_5", "init": "glorot_uniform", "subsample": [1, 1], "bias": true, "W_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "activation": "relu", "output_dim": 1164, "input_dim": 1152, "bias": true, "name": "dense_1", "init": "glorot_uniform", "trainable": true, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "activation": "relu", "output_dim": 100, "input_dim": 1164, "bias": true, "name": "dense_2", "init": "glorot_uniform", "trainable": true, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "activation": "relu", "output_dim": 50, "input_dim": 100, "bias": true, "name": "dense_3", "init": "glorot_uniform", "trainable": true, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "activation": "relu", "output_dim": 10, "input_dim": 50, "bias": true, "name": "dense_4", "init": "glorot_uniform", "trainable": true, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "activation": "linear", "output_dim": 1, "input_dim": 10, "bias": true, "name": "dense_5", "init": "glorot_uniform", "trainable": true, "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}